Revit 2026 API

# MechanicalEquipmentSetAreValidMembers Method

---
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool AreValidMembers(
	Document document,
	ISet<ElementId> memberIds
)
```
```vb
Public Shared Function AreValidMembers (
	document As Document,
	memberIds As ISet(Of ElementId)
) As Boolean
```
```cpp
public:
static bool AreValidMembers(
	Document^ document,
	ISet<ElementId^>^ memberIds
)
```
```fsharp
static member AreValidMembers :
        document : Document *
        memberIds : ISet<ElementId> -> bool
```

#### Parameters

document Document

memberIds ISetElementId

#### Return Value

Boolean

#### Reference

MechanicalEquipmentSet Class

Autodesk.Revit.DB.Mechanical Namespace